src/Catalogs/ОбластиДелегированияПрав/ОбластиДелегированияПрав.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбластиДелегированияПрав</name>
  <predefined>
    <items>
      <name>АдминистративныеФункции</name>
      <description>Административные функции</description>
    </items>
    <items>
      <name>ДокументыИФайлы</name>
      <description>Документы и файлы</description>
    </items>
    <items>
      <name>ЕжедневныеОтчеты</name>
      <description>Ежедневные отчеты</description>
    </items>
    <items>
      <name>Календарь</name>
      <description>Календарь</description>
    </items>
    <items>
      <name>Контроль</name>
      <description>Контроль</description>
    </items>
    <items>
      <name>Мероприятия</name>
      <description>Мероприятия</description>
    </items>
    <items>
      <name>Обсуждения</name>
      <description>Обсуждения</description>
    </items>
    <items>
      <name>Почта</name>
      <description>Почта</description>
    </items>
    <items>
      <name>Проекты</name>
      <description>Проекты</description>
    </items>
    <items>
      <name>ПроцессыИЗадачи</name>
      <description>Процессы и задачи</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ОбластиДелегированияПрав/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура СоздатьОбластиДелегированияЕслиНужно() Экспорт
	
	ОписаниеОбластейДелегирования = НастраиваемоеДелегированиеПрав.ОписанияНачальногоЗаполненияОбластейДелегирования();
	Для Каждого Строка Из ОписаниеОбластейДелегирования Цикл
		
		ОбластьДелегированияСсылка = Справочники.ОбластиДелегированияПрав.ПолучитьСсылку(
			Новый УникальныйИдентификатор(Строка.Идентификатор));
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ИСТИНА
			|ИЗ
			|	Справочник.ОбластиДелегированияПрав КАК ОбластиДелегированияПрав
			|ГДЕ
			|	ОбластиДелегированияПрав.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", ОбластьДелегированияСсылка);
		
		Если Запрос.Выполнить().Пустой() Тогда // Элемента данных нет, нужно создать новый
			ОбластьОбъект = Справочники.ОбластиДелегированияПрав.СоздатьЭлемент();
			ОбластьОбъект.УстановитьСсылкуНового(ОбластьДелегированияСсылка);
			ОбластьОбъект.Наименование = Строка.Наименование;
			ОбластьОбъект.ИмяПредопределенныхДанных = Строка.ИмяПредопределенного;
			Для Каждого ПолноеИмя Из Строка.Состав Цикл
				НоваяСтрока = ОбластьОбъект.Состав.Добавить();
				НоваяСтрока.ОбъектМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПолноеИмя);
			КонецЦикла;
			ОбластьОбъект.ДополнительныеСвойства.Вставить("НеПересчитыватьПрава", Истина);
			ОбластьОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
